      *****************************************************************
      * FXRATE01 - FX rate to EUR by currency (20 bytes)
      *****************************************************************
       01  FX-RATE-REC.
           05 FX-RATE-CURRENCY           PIC X(3).
           05 FX-RATE-TO-EUR             PIC 9(3)V9(6).
           05 FX-RATE-DATE               PIC 9(8).
