      *****************************************************************
      * REMRULE1 - Remediation policy rule (120 bytes)
      *****************************************************************
       01  REM-RULE-REC.
           05 REM-RULE-SEVERITY          PIC X(1).
           05 REM-RULE-ROUTE             PIC X(8).
           05 REM-RULE-ACTION            PIC X(20).
           05 REM-RULE-AUTO-FLAG         PIC X(1).
           05 REM-RULE-PRIORITY          PIC 9(2).
           05 REM-RULE-MESSAGE           PIC X(60).
           05 REM-RULE-FILLER            PIC X(28).
